app/controllers/songs_controller.rb

  def upload

    CSV.foreach(params[:songs].path, headers: true) do |s|
      a = Artist.find_or_create_by(name: s[1])
      Song.create(title: s[0], artist_id: a.id)
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2021-06-06 17:10:39.533795"], ["updated_at", "2021-06-06 17:10:39.533795"]]
INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2021-06-06 17:10:39.550858"], ["updated_at", "2021-06-06 17:10:39.550858"], ["artist_id", 1]]